Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [4]:
import pandas as pd
import numpy as np
# Creating empty series
ser = pd.Series(np.array([4,8,15,16,23,42]))
 
print(ser)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [6]:
list_num = [i for i in range(1,11)]
ser = pd.Series(np.array(list_num ))
 
print(ser)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3.

In [12]:
data_1={'Name':['Alice','Bob','Claire'],
       'Age':[25,30,27],
       'Gender':['Female','Male','Female']}

df1=pd.DataFrame(data_1)

df1.head()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
Dataframe can store multliple columns whereas Series only support storing single columns.

In [13]:
#data frame

data_1={'Name':['Pratik','Raj','Pranav'],
       'Age':[25,25,31],
       'Gender':['Male','Male','Male']}

df1=pd.DataFrame(data_1)

df1.head()

     Name  Age Gender
0  Pratik   25   Male
1     Raj   25   Male
2  Pranav   31   Male

In [14]:
#series
list_age = [25,26,30]
ser = pd.Series(np.array(list_age))
 
print(ser)

0    25
1    26
2    30
dtype: int64

In above examples if you see Series can only hold one list.<br>
But Datarame can hold multiple columns

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?
-> Drop() function is use to remove columns or rows from dataFrame.<br>
isnull() functions is use for calculating null values in data frames<br>
dropna() function used for droping null value rows or columns in dataframe.

In [15]:
#data frame

data_1={'Name':['Pratik','Raj','Pranav'],
       'Age':[25,25,31],
       'Gender':['Male','Male','Male']}

df1=pd.DataFrame(data_1)

df1.head()

     Name  Age Gender
0  Pratik   25   Male
1     Raj   25   Male
2  Pranav   31   Male

In [18]:
df1=df1.drop('Gender',axis='columns')
df1.head()

     Name  Age
0  Pratik   25
1     Raj   25
2  Pranav   31

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?<br>
->Series Objects are value-mutable but size-immutable objects<br>
->Dataframe is mutable<br>

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [20]:
import pandas as pd
# Create pandas Series
courses = pd.Series(["Btech","Mtech","Msc"])
fees = pd.Series([1200000,1400000,40000])

# Combine two series.
df=pd.concat([courses,fees],axis=1)


print(df)

       0        1
0  Btech  1200000
1  Mtech  1400000
2    Msc    40000